3A/PHYS234/Schrodinger-Time-Evolution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-14 Thu 00:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Schrödinger Time Evolution</title>
<meta name="author" content="DESKTOP-H800RKQ" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Schrödinger Time Evolution</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3df4bc7">1. Schrödinger Equation</a>
<ul>
<li><a href="#org40b669e">1.1. Recipe for Solving Time-Dependent Quantum Mechanics</a></li>
</ul>
</li>
<li><a href="#org825913b">2. Spin Precession</a>
<ul>
<li><a href="#org6d6b8ca">2.1. Magnetic Field in the z-Direction</a></li>
<li><a href="#org7fad091">2.2. Magnetic Field in a General Direction</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3df4bc7" class="outline-2">
<h2 id="org3df4bc7"><span class="section-number-2">1.</span> Schrödinger Equation</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Postulate 6</b>: the time evolution of a quantum system is determined by the Hamiltonian or total energy
operator \(H(t)\) through the Schrödinger equation
\[
i\hslash \frac{d}{dt} \ket{\psi(t)} = H(t) \ket{\psi(t)}
\]
</p>

<p>
The Hamiltonian is an observable so it is a Hermetian operator.
The energy eigenvalue equation is
\[
H \ket{E_{n}} = E_{n} \ket{E_{n}}
\]
</p>

<p>
The basis of eigenvectors of the Hamiltonian is the <b>energy basis</b>.
</p>

<p>
If the initial state of the system at time 0 is
\[
\ket{\psi(0)} = \sum_{n} c_{n} \ket{E_{n}}
\]
then the time evolution of this state under the action of the time-independent Hamiltonian \(H\)
is
\[
\ket{\psi(t)} = \sum_{n} c_{n} e^{-iE_{n} t/\hslash} \ket{E_{n}}
\]
</p>

<p>
For an observable \(A\) whose eigenstates consist of superpositions of energy eigenstates,
where \(\ket{a_{1}} = \alpha_{1} \ket{E_{1}} + \alpha_{2} \ket{E_{2}}\).
Then for \(\ket{psi(0)} = c_{1}\ket{E_{1}} + c_{2} \ket{E_{2}}\),
$$
P<sub>a<sub>1</sub></sub> = |&alpha;<sub>1</sub>|<sup>2</sup> |c<sub>1</sub>|<sup>2</sup> + |&alpha;<sub>2</sub>|<sup>2</sup> |c<sub>2</sub>|<sup>2</sup>
</p>
<ul class="org-ul">
<li>2\text{Re}\left( &alpha;<sub>1</sub> c<sub>1</sub><sup>\*</sup> &alpha;<sub>2</sub><sup>\*</sup> c<sub>2</sub> e<sup>-i(E<sub>2</sub> - E<sub>1</sub>)t/\hslash</sup> \right)</li>
</ul>
<p>
\[
and so the probabilities are time dependent, which is determined by the difference of the energies
of the 2 states involved in the superposition.
The corresponding angular frequency of the time evolution
\]
&omega;<sub>21</sub> = \frac{E<sub>2</sub> - E<sub>1</sub>}{\hslash}
$$
is the <b>Bohr frequency</b>.
</p>
</div>
<div id="outline-container-org40b669e" class="outline-3">
<h3 id="org40b669e"><span class="section-number-3">1.1.</span> Recipe for Solving Time-Dependent Quantum Mechanics</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Given a Hamiltonian \(H\) and an initial state \(\ket{\psi(0)}\), find the probability that
the eigenvalue \(a_{j}\) of the observable \(A\) is measured at time \(t\).
</p>
<ol class="org-ol">
<li>Diagonalize \(H\) to find the eigenvalues and eigenvectors for the energies.</li>
<li>Write \(\ket{\psi(0)}\) in terms of the energy eigenstates \(\ket{E_{n}}\).</li>
<li>Multiply each eigenstate coefficient by \(e^{-iE_{n}t/\hslash}\) to get \(\ket{\psi(t)}\).</li>
<li>Calculate the probability \(P_{a_{j}} = \left| \braket{a_{j} \mid \psi(t)} \right|^{2}\).</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org825913b" class="outline-2">
<h2 id="org825913b"><span class="section-number-2">2.</span> Spin Precession</h2>
<div class="outline-text-2" id="text-2">
<p>
For the magnetic dipole
\[
\mu = g \frac{q}{2m_{e}} S
\]
the Hamiltonian is
\[
H = -g \frac{q}{2m_{e}} S \cdot B
\]
</p>
</div>
<div id="outline-container-org6d6b8ca" class="outline-3">
<h3 id="org6d6b8ca"><span class="section-number-3">2.1.</span> Magnetic Field in the z-Direction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
If \(B = B_{0} \hat{z}\), then \(H = \omega_{0} S_{z}\)
for \(\omega_{0} = -g\frac{q}{2m_{e}} B_{0}\).
</p>

<p>
<b>Spin precession</b>: where probabilities change for certain spins since the Hamiltonian
is defined for other spins
</p>

<p>
<b>Larmor precession</b>: the precession of the spin vector
</p>

<p>
<b>Larmor frequency</b>: the frequency of precession
</p>

<p>
<b>Ehrenfest&rsquo;s Theorem</b>: quantum mechanical expectation values obey classical laws
</p>
</div>
</div>
<div id="outline-container-org7fad091" class="outline-3">
<h3 id="org7fad091"><span class="section-number-3">2.2.</span> Magnetic Field in a General Direction</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Spin flip</b>: where a state flips to the orthogonal state
</p>

<p>
The probability of a spin flip is
\[
P_{+ \to -} = \frac{\omega_{1}^{2}}{\omega_{0}^{2} + \omega_{1}^{2}}
\sin^{2} \left( \frac{\sqrt{\omega_{0}^{2} + \omega_{1}^{2}}}{2} t \right)
\]
which is Rabi&rsquo;s formula.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DESKTOP-H800RKQ</p>
<p class="date">Created: 2024-03-14 Thu 00:25</p>
</div>
</body>
</html>
